; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 ball box - object_
 )
 (:constants
   empty - empty_0
   room_3 room_1 room_4 - room
   grey_ball_1 - ball
   purple_door_2 - door
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0) (hold_1) (hold_2) (seen_psi_3))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (when (or (= ?room2 room_4) (and (agentinroom room_4) (not (= ?room1 room_4)))) (hold_0)) (when (and (or (= ?room2 room_4) (and (agentinroom room_4) (not (= ?room1 room_4)))) (not (or (= ?room2 room_1) (and (agentinroom room_1) (not (= ?room1 room_1)))))) (not (hold_1))) (when (or (= ?room2 room_1) (and (agentinroom room_1) (not (= ?room1 room_1)))) (hold_1)) (when (or (= ?room2 room_3) (and (agentinroom room_3) (not (= ?room1 room_3))) (carrying grey_ball_1)) (seen_psi_3)) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (when (or (agentinroom room_3) (= ?obj grey_ball_1) (carrying grey_ball_1)) (seen_psi_3)) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (when (or (agentinroom room_3) (and (carrying grey_ball_1) (not (= ?obj grey_ball_1)))) (seen_psi_3)) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door) (or (and (not (locked ?door)) (= ?door purple_door_2)) (and (locked purple_door_2) (not (and (locked ?door) (= ?door purple_door_2)))) (seen_psi_3)))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (when (not (or (and (not (locked ?door)) (= ?door purple_door_2)) (and (locked purple_door_2) (not (and (locked ?door) (= ?door purple_door_2)))))) (hold_2)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_2 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   purple_door_1 blue_door_1 grey_door_1 - door
   green_ball_1 purple_ball_1 grey_ball_2 red_ball_1 purple_ball_2 blue_ball_1 - ball
   grey_box_1 - box
 )
 (:init (agentinroom room_4) (objectinroom green_ball_1 room_1) (objectinroom red_ball_1 room_1) (objectinroom grey_ball_1 room_2) (objectinroom grey_box_1 room_2) (objectinroom purple_ball_1 room_2) (objectinroom purple_ball_2 room_3) (objectinroom blue_ball_1 room_3) (objectinroom grey_ball_2 room_4) (objectcolor green_ball_1 greentype) (objectcolor red_ball_1 redtype) (objectcolor grey_ball_1 greytype) (objectcolor grey_box_1 greytype) (objectcolor purple_ball_1 purpletype) (objectcolor purple_ball_2 purpletype) (objectcolor blue_ball_1 bluetype) (objectcolor grey_ball_2 greytype) (objectcolor purple_door_1 purpletype) (objectcolor blue_door_1 bluetype) (objectcolor grey_door_1 greytype) (objectcolor purple_door_2 purpletype) (emptyhands) (locked purple_door_1) (locked blue_door_1) (locked grey_door_1) (locked purple_door_2) (adjacentrooms room_2 room_1 purple_door_1) (adjacentrooms room_1 room_2 purple_door_1) (adjacentrooms room_3 room_1 blue_door_1) (adjacentrooms room_1 room_3 blue_door_1) (adjacentrooms room_4 room_2 grey_door_1) (adjacentrooms room_2 room_4 grey_door_1) (adjacentrooms room_4 room_3 purple_door_2) (adjacentrooms room_3 room_4 purple_door_2) (visited room_4) (hold_0) (= (total-cost) 0))
 (:goal (and (exists (?d - door)
 (and (objectcolor ?d bluetype) (at_ ?d) (not (locked ?d)))) (hold_0) (hold_1) (hold_2)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor grey_door_1 room_4 room_2)
   added: (at_ grey_door_1)
   goals met: 1 of 4
2. (toggle grey_door_1)
   deleted: (locked grey_door_1)
   goals met: 1 of 4
3. (gotoroom room_4 room_2 grey_door_1)
   deleted: (agentinroom room_4) (at_ grey_door_1)
   added: (agentinroom room_2) (visited room_2)
   goals met: 1 of 4
4. (gotodoor purple_door_1 room_2 room_1)
   added: (at_ purple_door_1)
   goals met: 1 of 4
5. (toggle purple_door_1)
   deleted: (locked purple_door_1)
   goals met: 1 of 4
6. (gotoroom room_2 room_1 purple_door_1)
   deleted: (agentinroom room_2) (at_ purple_door_1)
   added: (agentinroom room_1) (visited room_1) (hold_1)
   goals met: 2 of 4
7. (gotodoor blue_door_1 room_1 room_3)
   added: (at_ blue_door_1)
   goals met: 2 of 4
8. (toggle blue_door_1)
   deleted: (locked blue_door_1)
   goals met: 3 of 4
9. (gotoroom room_1 room_3 blue_door_1)
   deleted: (agentinroom room_1) (at_ blue_door_1)
   added: (agentinroom room_3) (visited room_3) (seen_psi_3)
   goals met: 2 of 4
10. (gotodoor purple_door_2 room_3 room_4)
   added: (at_ purple_door_2)
   goals met: 2 of 4
11. (toggle purple_door_2)
   deleted: (locked purple_door_2)
   added: (hold_2)
   goals met: 3 of 4
12. (gotodoor blue_door_1 room_3 room_1)
   deleted: (at_ purple_door_2)
   added: (at_ blue_door_1)
   goals met: 4 of 4
